paladinzh/BLE_Mesh/NRF_MESH/nRF5_SDK_for_Mesh/mesh/test/src/ut_prov_bearer_adv.c
nrf_mesh_assertion_handler_t m_assertion_handler;

void nrf_mesh_assertion_handler(uint32_t pc)
{
    TEST_FAIL_MESSAGE("Mesh assertion triggered");
}

/********** Local Mock Functions **********/
static void advertiser_instance_init_cb(advertiser_t * p_adv, advertiser_tx_complete_cb_t tx_cb, uint8_t * p_buffer, uint32_t buffer_size, int calls)
{
    TEST_ASSERT_EQUAL(m_expected_adv_init.p_advertiser, p_adv);
    TEST_ASSERT_EQUAL(m_expected_adv_init.p_adv_buf, p_buffer);
    TEST_ASSERT_EQUAL(m_expected_adv_init.adv_buf_size, buffer_size);
    TEST_ASSERT_NOT_NULL(tx_cb);
    TEST_ASSERT_NOT_EQUAL(0, m_expected_adv_init.calls);
    m_expected_adv_init.calls--;
    m_tx_complete_cb = tx_cb;
}

static void advertiser_instance_init_ExpectStub(advertiser_t * p_adv, uint8_t * p_buffer, uint32_t buffer_size)
{
    advertiser_instance_init_StubWithCallback(advertiser_instance_init_cb);
    m_expected_adv_init.p_advertiser = p_adv;
    m_expected_adv_init.p_adv_buf = p_buffer;
    m_expected_adv_init.adv_buf_size = buffer_size;
    m_expected_adv_init.calls++;
}

static bearer_event_flag_t bearer_event_flag_add_cb(bearer_event_flag_callback_t cb, int calls)
{
    TEST_ASSERT_NOT_NULL(cb);
    m_async_cb = cb;
    return ASYNC_FLAG;
}
/********** Test Setup **********/

void setUp(void)
{
    __LOG_INIT((LOG_SRC_PROV | LOG_SRC_TEST), LOG_LEVEL_ERROR, LOG_CALLBACK_DEFAULT);

    advertiser_mock_Init();
    provisioning_mock_Init();
    timer_scheduler_mock_Init();
    rand_mock_Init();
    prov_beacon_mock_Init();
    nrf_mesh_mock_Init();
    timer_mock_Init();

    bearer_event_flag_add_StubWithCallback(bearer_event_flag_add_cb);

    const prov_bearer_interface_t * p_bearer = prov_bearer_adv_interface_get();
    prov_bearer_adv_tx = p_bearer->tx;
    prov_bearer_adv_listen = p_bearer->listen_start;
    prov_bearer_adv_listen_stop = p_bearer->listen_stop;
    prov_bearer_adv_link_open = p_bearer->link_open;
    prov_bearer_adv_link_close = p_bearer->link_close;

    for (int i=0;i<PROV_PAYLOAD_MAX_LENGTH+1;i++)
    {
        data[i] = i;
    }
    m_assertion_handler = nrf_mesh_assertion_handler;
}

void tearDown(void)
{
    TEST_ASSERT_EQUAL(0, m_expected_adv_init.calls);
    advertiser_mock_Verify();
    advertiser_mock_Destroy();
    provisioning_mock_Verify();
    provisioning_mock_Destroy();
    timer_scheduler_mock_Verify();
    timer_scheduler_mock_Destroy();
    rand_mock_Verify();
    rand_mock_Destroy();
    prov_beacon_mock_Verify();
    prov_beacon_mock_Destroy();
    nrf_mesh_mock_Verify();
    nrf_mesh_mock_Destroy();
    timer_mock_Verify();
    timer_mock_Destroy();
}

/* In order to use the prov_bearer_adv function. */
extern uint8_t calculate_3GPP_CRC(const uint8_t * p_input, uint16_t size);

/********** Test functions **********/


static ble_ad_data_t * get_transaction_start_packet(uint8_t * p_data, uint16_t data_size, uint8_t transaction)
{
    uint8_t start_payload_size = data_size > PROV_START_PDU_PAYLOAD_MAX_LEN ? PROV_START_PDU_PAYLOAD_MAX_LEN : data_size;
    uint8_t segN = ((data_size - start_payload_size) > 0) * (data_size - start_payload_size)/PROV_CONTINUE_PDU_PAYLOAD_MAX_LEN; /*lint !e514 Boolean used in arithmetic */
    trans_data_payload[PROV_ADV_OVERHEAD - 1] = transaction;
    trans_data_payload[PROV_ADV_OVERHEAD] = (segN << 2) | PROV_TRANS_START_OPCODE_WITH_GPCF_FIELD;
    /* Total Length*/
    trans_data_payload[PROV_ADV_OVERHEAD + 2] = data_size & 0xFF;
    trans_data_payload[PROV_ADV_OVERHEAD + 1] = data_size >> 8;
    /* FCS*/
    trans_data_payload[PROV_ADV_OVERHEAD + 3] = calculate_3GPP_CRC(p_data, data_size);
    memcpy(&trans_data_payload[PROV_ADV_OVERHEAD + PROV_START_PDU_HEADER_SIZE ], p_data, start_payload_size);
    ble_ad_data_t * p_ad_data = (ble_ad_data_t *) trans_data_payload;
    p_ad_data->length =  1 /* AD Type */ + PROV_ADV_OVERHEAD - sizeof(ble_ad_data_t) + PROV_START_PDU_HEADER_SIZE + start_payload_size;
    p_ad_data->type = AD_TYPE_PB_ADV;
    return p_ad_data;
}

static ble_ad_data_t * get_transaction_continue_packet(uint8_t * p_data, uint16_t data_size, uint8_t transaction, uint8_t segment)
{
    uint8_t continue_payload_size = data_size > PROV_START_PDU_PAYLOAD_MAX_LEN ? (data_size - PROV_START_PDU_PAYLOAD_MAX_LEN) : 0;
    if (segment == 0 || continue_payload_size <= (segment - 1 ) * PROV_CONTINUE_PDU_PAYLOAD_MAX_LEN)
    {
        return NULL;
    }

    continue_payload_size -= (segment - 1 ) * PROV_CONTINUE_PDU_PAYLOAD_MAX_LEN;
    continue_payload_size = continue_payload_size > PROV_CONTINUE_PDU_PAYLOAD_MAX_LEN ? PROV_CONTINUE_PDU_PAYLOAD_MAX_LEN: continue_payload_size;
    trans_data_payload[PROV_ADV_OVERHEAD - 1] = transaction;
    trans_data_payload[PROV_ADV_OVERHEAD] = (segment << 2) | PROV_TRANS_CONTINUE_OPCODE_WITH_GPCF_FIELD;
    memcpy(&trans_data_payload[PROV_ADV_OVERHEAD + PROV_CONTINUE_PDU_HEADER_SIZE ], p_data + PROV_START_PDU_PAYLOAD_MAX_LEN + (segment - 1)* PROV_CONTINUE_PDU_PAYLOAD_MAX_LEN, continue_payload_size);
    ble_ad_data_t * p_ad_data = (ble_ad_data_t *) trans_data_payload;
    p_ad_data->length =  1 /* AD Type */ + PROV_ADV_OVERHEAD - sizeof(ble_ad_data_t) + PROV_CONTINUE_PDU_HEADER_SIZE + continue_payload_size;
    p_ad_data->type = AD_TYPE_PB_ADV;
    return p_ad_data;
}

static ble_ad_data_t * get_transaction_ack_packet(uint8_t transaction)
{
    trans_ack_payload[PROV_ADV_OVERHEAD - 1] = transaction;
    trans_ack_payload[PROV_ADV_OVERHEAD] = PROV_TRANS_ACK_OPCODE_WITH_GPCF_FIELD;
    ble_ad_data_t * p_ad_data = (ble_ad_data_t *) trans_ack_payload;
    p_ad_data->length =  1 /* AD Type */ + PROV_ADV_OVERHEAD - sizeof(ble_ad_data_t) + PROV_TRANS_ACK_DATA_SIZE;
    p_ad_data->type = AD_TYPE_PB_ADV;
    return p_ad_data;
}

static ble_ad_data_t * get_link_open_packet(uint8_t * p_uuid)
{
    link_open_payload[PROV_ADV_OVERHEAD] = PROV_LINK_OPEN_OPCODE_WITH_GPCF_FIELD;
    memcpy(&link_open_payload[PROV_ADV_OVERHEAD+1], p_uuid, NRF_MESH_UUID_SIZE);

    ble_ad_data_t * p_ad_data = (ble_ad_data_t *) link_open_payload;
    p_ad_data->length =  1 /* AD Type */ + PROV_ADV_OVERHEAD - sizeof(ble_ad_data_t) + PROV_LINK_OPEN_DATA_SIZE;
    p_ad_data->type = AD_TYPE_PB_ADV;
    return p_ad_data;
}

static ble_ad_data_t * get_link_ack_packet(void)
{
    link_ack_payload[PROV_ADV_OVERHEAD] = PROV_LINK_ACK_OPCODE_WITH_GPCF_FIELD;
    ble_ad_data_t * p_ad_data = (ble_ad_data_t *) link_ack_payload;
    p_ad_data->length =  1 /* AD Type */ + PROV_ADV_OVERHEAD - sizeof(ble_ad_data_t) + PROV_LINK_ACK_DATA_SIZE;
    p_ad_data->type = AD_TYPE_PB_ADV;
    return p_ad_data;
}

static ble_ad_data_t * get_link_close_packet(nrf_mesh_prov_link_close_reason_t close_reason)
{
    link_close_payload[PROV_ADV_OVERHEAD] = PROV_LINK_CLOSE_OPCODE_WITH_GPCF_FIELD;
    link_close_payload[PROV_ADV_OVERHEAD+1] = (uint8_t)close_reason;

    ble_ad_data_t * p_ad_data = (ble_ad_data_t *) link_close_payload;
    p_ad_data->length = 1 /* AD Type */ + PROV_ADV_OVERHEAD - sizeof(ble_ad_data_t) + PROV_LINK_CLOSE_DATA_SIZE;
    p_ad_data->type = AD_TYPE_PB_ADV;
    return p_ad_data;
}
static void rx_link_open(prov_bearer_adv_t * p_bearer, uint8_t * p_uuid, uint32_t link_id, bool accept)
{
    ble_ad_data_t *  p_ad_data  = get_link_open_packet(p_uuid);
    p_ad_data->data[3] = link_id & 0xFF;
    p_ad_data->data[2] = (link_id >> 8) & 0xFF;
    p_ad_data->data[1] = (link_id >> 16) & 0xFF;
    p_ad_data->data[0] = (link_id >> 24) & 0xFF;
    if (accept)
    {
        advertiser_interval_set_Expect(&p_bearer->advertiser, BEARER_ADV_INT_DEFAULT_MS);
        ALLOC_AND_TX(&p_bearer->advertiser, PROV_ADV_OVERHEAD + PROV_LINK_ACK_DATA_SIZE, true);
        prov_cb_link_opened_Expect(prov_bearer_adv_parent_get(p_bearer));
        timer_now_ExpectAndReturn(1000);
        timer_sch_reschedule_Expect(&p_bearer->link_timeout_event, 1000 + p_bearer->link_timeout);
    }
    prov_bearer_adv_packet_in(p_ad_data->data, p_ad_data->length - BLE_AD_DATA_OVERHEAD, &m_dummy_metadata);
    if (accept)
    {
        TEST_ASSERT_EQUAL(1, m_packet.config.repeats);
    }
}

