paladinzh/BLE_Mesh/NRF_MESH/nRF5_SDK_for_Mesh/mesh/test/src/ut_prov_bearer_adv.c
static void rx_link_ack(prov_bearer_adv_t * p_bearer, uint32_t link_id, bool accept)
{
    ble_ad_data_t * p_ad_data  = get_link_ack_packet();
    p_ad_data->data[3] = link_id & 0xFF;
    p_ad_data->data[2] = (link_id >> 8) & 0xFF;
    p_ad_data->data[1] = (link_id >> 16) & 0xFF;
    p_ad_data->data[0] = (link_id >> 24) & 0xFF;
    if (accept)
    {
        advertiser_flush_Expect(&p_bearer->advertiser);
        advertiser_interval_set_Expect(&p_bearer->advertiser, BEARER_ADV_INT_DEFAULT_MS);
        prov_cb_link_opened_Expect(prov_bearer_adv_parent_get(p_bearer));
        timer_now_ExpectAndReturn(1000);
        timer_sch_reschedule_Expect(&p_bearer->link_timeout_event, 1000 + p_bearer->link_timeout);
    }
    prov_bearer_adv_packet_in(p_ad_data->data, p_ad_data->length - BLE_AD_DATA_OVERHEAD, &m_dummy_metadata);
}

static void rx_link_close(prov_bearer_adv_t * p_bearer, nrf_mesh_prov_link_close_reason_t close_reason, uint32_t link_id,  bool accept)
{
    ble_ad_data_t * p_ad_data  = get_link_close_packet(close_reason);
    p_ad_data->data[3] = link_id & 0xFF;
    p_ad_data->data[2] = (link_id >> 8) & 0xFF;
    p_ad_data->data[1] = (link_id >> 16) & 0xFF;
    p_ad_data->data[0] = (link_id >> 24) & 0xFF;
    if (accept)
    {
        timer_sch_abort_Expect(&p_bearer->link_timeout_event);
        prov_cb_link_closed_Expect(prov_bearer_adv_parent_get(p_bearer), close_reason);
        advertiser_flush_Expect(&p_bearer->advertiser);
    }
    prov_bearer_adv_packet_in(p_ad_data->data, p_ad_data->length - BLE_AD_DATA_OVERHEAD, &m_dummy_metadata);
}

static void tx_link_open(prov_bearer_adv_t * p_bearer, uint8_t * p_uuid, uint32_t link_id)
{
    p_bearer->link_id = link_id;
    p_bearer->link_timeout = 1000;
    p_bearer->p_next = NULL;

    ALLOC_AND_TX(&p_bearer->advertiser, PROV_ADV_OVERHEAD + PROV_LINK_OPEN_DATA_SIZE, true);

    advertiser_instance_init_ExpectStub(&p_bearer->advertiser, p_bearer->tx_buffer, sizeof(p_bearer->tx_buffer));
    rand_hw_rng_get_Expect((uint8_t*) &p_bearer->link_id, sizeof(p_bearer->link_id));
    timer_now_ExpectAndReturn(1000);
    timer_sch_reschedule_Expect(&p_bearer->link_timeout_event, 1000 + PROV_PROVISIONING_LINK_TIMEOUT_MIN_US);
    advertiser_enable_Expect(&p_bearer->advertiser);
    TEST_ASSERT_EQUAL(NRF_SUCCESS, prov_bearer_adv_link_open(prov_bearer_adv_parent_get(p_bearer), p_uuid, PROV_PROVISIONING_LINK_TIMEOUT_MIN_US));
    TEST_ASSERT_EQUAL(PROV_BEARER_ADV_UNACKED_REPEAT_COUNT, m_packet.config.repeats);
}

static void tx_link_close(prov_bearer_adv_t * p_bearer, nrf_mesh_prov_link_close_reason_t close_reason)
{
    ALLOC_AND_TX(&p_bearer->advertiser, PROV_ADV_OVERHEAD + PROV_LINK_CLOSE_DATA_SIZE, true);
    prov_bearer_adv_link_close(prov_bearer_adv_parent_get(p_bearer), close_reason);
    TEST_ASSERT_EQUAL(PROV_BEARER_ADV_UNACKED_REPEAT_COUNT, m_packet.config.repeats);

    /* Send queue empty in order to move on to link closed state */
    advertiser_flush_Expect(&p_bearer->advertiser);
    prov_cb_link_closed_Expect(prov_bearer_adv_parent_get(p_bearer), close_reason);
    timer_sch_abort_Expect(&p_bearer->link_timeout_event);
    p_bearer->queue_empty_pending = true;
    TEST_ASSERT_NOT_NULL(m_async_cb);
    m_async_cb();
}

static void listen_start(prov_bearer_adv_t * p_bearer)
{
    advertiser_instance_init_ExpectStub(&p_bearer->advertiser, p_bearer->tx_buffer, sizeof(p_bearer->tx_buffer));
    advertiser_enable_Expect(&p_bearer->advertiser);
    prov_beacon_unprov_build_ExpectAndReturn(&p_bearer->advertiser, NULL, 0, &m_packet);
    advertiser_interval_set_Expect(&p_bearer->advertiser, NRF_MESH_UNPROV_BEACON_INTERVAL_MS);
    advertiser_packet_send_Expect(&p_bearer->advertiser, &m_packet);
    TEST_ASSERT_EQUAL(NRF_SUCCESS, prov_bearer_adv_listen(prov_bearer_adv_parent_get(p_bearer), NULL, 0, PROV_PROVISIONING_LINK_TIMEOUT_MIN_US));
    TEST_ASSERT_EQUAL(ADVERTISER_REPEAT_INFINITE, m_packet.config.repeats);
}

static void listen_stop(prov_bearer_adv_t * p_bearer)
{
    advertiser_flush_Expect(&p_bearer->advertiser);
    TEST_ASSERT_EQUAL(NRF_SUCCESS, prov_bearer_adv_listen_stop(prov_bearer_adv_parent_get(p_bearer)));
}

static void receive_data_ack(prov_bearer_adv_t * p_bearer, uint32_t link_id, bool accept)
{
    ble_ad_data_t * p_ad_data  = get_transaction_ack_packet(p_bearer->transaction_out);
    p_ad_data->data[3] = link_id & 0xFF;
    p_ad_data->data[2] = (link_id >> 8) & 0xFF;
    p_ad_data->data[1] = (link_id >> 16) & 0xFF;
    p_ad_data->data[0] = (link_id >> 24) & 0xFF;
    if (accept)
    {
        timer_now_ExpectAndReturn(1000);
        timer_sch_reschedule_Expect(&p_bearer->link_timeout_event, 1000 + p_bearer->link_timeout);
        timer_sch_abort_Expect(&p_bearer->timeout_event);
        advertiser_flush_Expect(&p_bearer->advertiser);
        prov_cb_ack_in_Expect(prov_bearer_adv_parent_get(p_bearer));
    }
    prov_bearer_adv_packet_in(p_ad_data->data, p_ad_data->length - BLE_AD_DATA_OVERHEAD, &m_dummy_metadata);
}

static uint8_t send_data_packet_internals(prov_bearer_adv_t * p_bearer, uint8_t * p_data, uint8_t data_length)
{
    uint8_t no_segments = 1;
    uint8_t remaninig_data_length = data_length > PROV_START_PDU_PAYLOAD_MAX_LEN ? PROV_START_PDU_PAYLOAD_MAX_LEN : data_length;
    /* Start packet:*/
    ALLOC_AND_TX(&p_bearer->advertiser, PROV_ADV_OVERHEAD + PROV_START_PDU_HEADER_SIZE + remaninig_data_length, true);
    remaninig_data_length = data_length - remaninig_data_length;
    while (remaninig_data_length > 0)
    {
        no_segments++;
        uint8_t current_chunk_data_length = remaninig_data_length > PROV_CONTINUE_PDU_PAYLOAD_MAX_LEN ? PROV_CONTINUE_PDU_PAYLOAD_MAX_LEN: remaninig_data_length;
        ALLOC_AND_TX(&p_bearer->advertiser, PROV_ADV_OVERHEAD + PROV_CONTINUE_PDU_HEADER_SIZE + current_chunk_data_length, true);
        remaninig_data_length -= current_chunk_data_length;
    }
    return no_segments;
}

static uint8_t send_data_packet(prov_bearer_adv_t * p_bearer, uint8_t * p_data, uint8_t data_length)
{
    uint8_t no_segments = send_data_packet_internals(p_bearer, p_data, data_length);
    timer_now_ExpectAndReturn(0);
    timer_now_ExpectAndReturn(0);
    timer_sch_reschedule_Expect(&p_bearer->link_timeout_event, 0);
    timer_sch_reschedule_IgnoreArg_new_timestamp();
    timer_sch_reschedule_Expect(&p_bearer->timeout_event, 0);
    timer_sch_reschedule_IgnoreArg_new_timestamp();
    (void) prov_bearer_adv_tx(prov_bearer_adv_parent_get(p_bearer), p_data, data_length);
    return no_segments;
}

static void receive_data(prov_bearer_adv_t * p_bearer, uint8_t * p_data, uint16_t data_length, uint8_t transcation, uint32_t link_id)
{
    /* Can't receive data until a link is established*/
    ble_ad_data_t * p_ad_data  = get_transaction_start_packet(p_data, data_length, transcation);
    p_ad_data->data[3] = link_id & 0xFF;
    p_ad_data->data[2] = (link_id >> 8) & 0xFF;
    p_ad_data->data[1] = (link_id >> 16) & 0xFF;
    p_ad_data->data[0] = (link_id >> 24) & 0xFF;

    ALLOC_AND_TX(&p_bearer->advertiser, PROV_ADV_OVERHEAD + PROV_TRANS_ACK_DATA_SIZE, true);
    prov_cb_pkt_in_Expect(prov_bearer_adv_parent_get(p_bearer), NULL, data_length);
    prov_cb_pkt_in_IgnoreArg_p_data();
    timer_now_ExpectAndReturn(1000);
    timer_sch_reschedule_Expect(&p_bearer->link_timeout_event, 1000 + p_bearer->link_timeout);
    prov_bearer_adv_packet_in(p_ad_data->data, p_ad_data->length - BLE_AD_DATA_OVERHEAD, &m_dummy_metadata);
    TEST_ASSERT_EQUAL(1, m_packet.config.repeats);

