paladinzh/BLE_Mesh/NRF_MESH/nRF5_SDK_for_Mesh/mesh/test/src/ut_prov_bearer_adv.c
    /* RX a packet with LINK_OPEN command using wrong uuid*/
    nrf_mesh_configure_device_uuid_get_ExpectAndReturn(uuid1);
    rx_link_open(&bearer.bearer.pb_adv, uuid2, link_id, false);

    /* Fail RX of a packet with LINK_OPEN command due to PACKET MANAGER*/
    nrf_mesh_configure_device_uuid_get_ExpectAndReturn(uuid1);
    advertiser_interval_set_Expect(&bearer.bearer.pb_adv.advertiser, BEARER_ADV_INT_DEFAULT_MS);
    ALLOC_AND_TX(&bearer.bearer.pb_adv.advertiser, PROV_ADV_OVERHEAD + PROV_LINK_ACK_DATA_SIZE, false);
    rx_link_open(&bearer.bearer.pb_adv, uuid1, link_id, false);

    /* State shouldn't have changed due to the failures, so a successful RX should be possible: */

    /* RX a packet with LINK_OPEN command*/
    nrf_mesh_configure_device_uuid_get_ExpectAndReturn(uuid1);
    rx_link_open(&bearer.bearer.pb_adv, uuid1, link_id, true);

    /* Sending another link open should produce an ack without the callback to higher layers */
    ALLOC_AND_TX(&bearer.bearer.pb_adv.advertiser, PROV_ADV_OVERHEAD + PROV_LINK_ACK_DATA_SIZE, true);
    nrf_mesh_configure_device_uuid_get_ExpectAndReturn(uuid1);
    rx_link_open(&bearer.bearer.pb_adv, uuid1, link_id, false);
    TEST_ASSERT_EQUAL(1, m_packet.config.repeats);


    TEST_ASSERT_EQUAL(NRF_ERROR_INVALID_STATE, prov_bearer_adv_listen(&bearer, NULL, 0, PROV_PROVISIONING_LINK_TIMEOUT_MIN_US));
    TEST_ASSERT_EQUAL(NRF_ERROR_INVALID_STATE, prov_bearer_adv_link_open(&bearer, uuid1, PROV_PROVISIONING_LINK_TIMEOUT_MIN_US));

    /* RX a packet with LINK_CLOSE command, expect a callback*/
    rx_link_close(&bearer.bearer.pb_adv, NRF_MESH_PROV_LINK_CLOSE_REASON_SUCCESS, link_id, true);

    /* RX a packet with LINK_OPEN command, do not expect a link opened callback*/
    nrf_mesh_configure_device_uuid_get_ExpectAndReturn(uuid1);
    rx_link_open(&bearer.bearer.pb_adv, uuid1, link_id, false);
}

void test_multiple_bearer(void)
{
    prov_bearer_t bearer1 = {0};
    prov_bearer_t bearer2 = {0};
    prov_bearer_t bearer3 = {0};
    prov_bearer_t bearer4 = {0};
    uint32_t link_id1 = 0x1;
    uint32_t link_id2 = 0x10;
    uint32_t link_id3 = 0x100;
    uint32_t link_id4 = 0x1000;

    /** Test out of order connection establishment (both as provisioner and provisionee). */
    /* Start listenining on bearer 1. */
    listen_start(&bearer1.bearer.pb_adv);
    /* Open link 2. */
    tx_link_open(&bearer2.bearer.pb_adv, uuid2, link_id2);
    /* Open link 3. */
    tx_link_open(&bearer3.bearer.pb_adv, uuid1, link_id3);
    /* Stop listening on bearer1 before listening on bearer4 (out of order listening is not allowed)*/
    /* Stopping bearer 1 after taking action with bearer 2 and 3 in order to test remove_active_bearer
       function in prov_bearer_adv.c */
    listen_stop(&bearer1.bearer.pb_adv);
    /* Start listenining on bearer 4. */
    listen_start(&bearer4.bearer.pb_adv);
    /* Send link open on bearer1: doing this after starting to listen on bearer 4 in order to test
       get_bearer_from_state  function in prov_bearer_adv.c */
    tx_link_open(&bearer1.bearer.pb_adv, uuid2, link_id1);

    /* LINK_OPEN for bearer4*/
    nrf_mesh_configure_device_uuid_get_ExpectAndReturn(uuid1);
    rx_link_open(&bearer4.bearer.pb_adv, uuid1, link_id4, true);
    /* Link ACK for bearer 1, 2 and 3*/
    rx_link_ack(&bearer3.bearer.pb_adv, link_id3, true);
    /* Link ACK */
    rx_link_ack(&bearer1.bearer.pb_adv, link_id1, true);
    /* Link ACK */
    rx_link_ack(&bearer2.bearer.pb_adv, link_id2, true);

    rx_link_close(&bearer1.bearer.pb_adv, NRF_MESH_PROV_LINK_CLOSE_REASON_SUCCESS, link_id1, true);
    rx_link_close(&bearer2.bearer.pb_adv, NRF_MESH_PROV_LINK_CLOSE_REASON_SUCCESS, link_id2, true);
    rx_link_close(&bearer3.bearer.pb_adv, NRF_MESH_PROV_LINK_CLOSE_REASON_SUCCESS, link_id3, true);
    rx_link_close(&bearer4.bearer.pb_adv, NRF_MESH_PROV_LINK_CLOSE_REASON_SUCCESS, link_id4, true);
}

void test_packet_send(void)
{
    prov_bearer_t bearer = {0};
    uint32_t link_id = 0;
    uint8_t curr_transcation = PROVISIONER_TRANSACTION_START_VALUE;
    /* Can't send data until a link is established*/
    TEST_ASSERT_EQUAL(NRF_ERROR_INVALID_STATE, prov_bearer_adv_tx(&bearer, data, PROV_PAYLOAD_MAX_LENGTH));

    /** Establish a connection **/
    /* Open link. */
    tx_link_open(&bearer.bearer.pb_adv, uuid1, link_id);
    /* Link ACK */
    rx_link_ack(&bearer.bearer.pb_adv, link_id, true);

    /* Can't send data larger than PROV_PAYLOAD_MAX_LENGTH */
    TEST_ASSERT_EQUAL(NRF_ERROR_INVALID_LENGTH, prov_bearer_adv_tx(&bearer, data, PROV_PAYLOAD_MAX_LENGTH+1));

    /* Send 1 byte long data */
    uint8_t no_segments = send_data_packet(&bearer.bearer.pb_adv, data, 1);
    /* transcation no starts with 0 when in provisioner role (section 5.2.1 in Mesh Profile Specification v1.0) */
    TEST_ASSERT_EQUAL(curr_transcation, bearer.bearer.pb_adv.transaction_out);
    TEST_ASSERT_EQUAL(1, no_segments);
    /* Can't send data without receiving an ack or timeout for the previous one*/
    TEST_ASSERT_EQUAL(NRF_ERROR_BUSY, prov_bearer_adv_tx(&bearer, data, 1));
    /* Send in an ack */
    receive_data_ack(&bearer.bearer.pb_adv, link_id, true);
    curr_transcation++;

    /* Send the largest packet that can fit into a single segment. */
    no_segments = send_data_packet(&bearer.bearer.pb_adv, data, PROV_START_PDU_PAYLOAD_MAX_LEN);
    /* transcation no must be incremented for each new transaction */
    TEST_ASSERT_EQUAL(curr_transcation, bearer.bearer.pb_adv.transaction_out);
    TEST_ASSERT_EQUAL(1, no_segments);
    /* Send in the expected ack */
    receive_data_ack(&bearer.bearer.pb_adv, link_id, true);
    curr_transcation++;

    /* Send a large enough packet to split it in two with only 1 byte in the continue packet. */
    no_segments = send_data_packet(&bearer.bearer.pb_adv, data, PROV_START_PDU_PAYLOAD_MAX_LEN + 1);
    /* transcation no must be incremented for each new transaction */
    TEST_ASSERT_EQUAL(curr_transcation, bearer.bearer.pb_adv.transaction_out);
    TEST_ASSERT_EQUAL(2, no_segments);
    /* Send in the expected ack */
    receive_data_ack(&bearer.bearer.pb_adv, link_id, true);
    curr_transcation++;

    /* Send a large packet that barely fits two packets*/
    no_segments = send_data_packet(&bearer.bearer.pb_adv, data, PROV_START_PDU_PAYLOAD_MAX_LEN + PROV_CONTINUE_PDU_PAYLOAD_MAX_LEN);
    /* transcation no must be incremented for each new transaction */
    TEST_ASSERT_EQUAL(curr_transcation, bearer.bearer.pb_adv.transaction_out);
    TEST_ASSERT_EQUAL(2, no_segments);
    /* Send in the expected ack */
    receive_data_ack(&bearer.bearer.pb_adv, link_id, true);
    curr_transcation++;

    /* Send a large enough packet to split it in three with only 1 byte in the last continue packet. */
    no_segments = send_data_packet(&bearer.bearer.pb_adv, data, PROV_START_PDU_PAYLOAD_MAX_LEN + PROV_CONTINUE_PDU_PAYLOAD_MAX_LEN + 1);
    /* transcation no must be incremented for each new transaction */
    TEST_ASSERT_EQUAL(curr_transcation, bearer.bearer.pb_adv.transaction_out);
    TEST_ASSERT_EQUAL(3, no_segments);
    /* Send in the expected ack */
    receive_data_ack(&bearer.bearer.pb_adv, link_id, true);
    curr_transcation++;

    /* Send the largest possible data packet */
    no_segments = send_data_packet(&bearer.bearer.pb_adv, data, PROV_PAYLOAD_MAX_LENGTH);
    /* transcation no must be incremented for each new transaction */
    TEST_ASSERT_EQUAL(curr_transcation, bearer.bearer.pb_adv.transaction_out);
    TEST_ASSERT_EQUAL(3, no_segments);
    /* No ack, send a timeout */
    (void) send_data_packet_internals(&bearer.bearer.pb_adv, data, PROV_PAYLOAD_MAX_LENGTH);
    bearer.bearer.pb_adv.timeout_event.cb(0, &bearer.bearer.pb_adv);
    /* Transcation no must remain the same */
    TEST_ASSERT_EQUAL(curr_transcation, bearer.bearer.pb_adv.transaction_out);
    TEST_ASSERT_EQUAL(3, no_segments);
    /* Send in an ack */
    receive_data_ack(&bearer.bearer.pb_adv, link_id, true);
    curr_transcation++;
    TEST_ASSERT_EQUAL(curr_transcation, bearer.bearer.pb_adv.transaction_out);

    /* Close link*/
    rx_link_close(&bearer.bearer.pb_adv, NRF_MESH_PROV_LINK_CLOSE_REASON_SUCCESS, link_id, true);
}

void test_packet_send_abnormal(void)
{
    prov_bearer_t bearer = {0};
    uint32_t link_id = 0x12345678;
    uint8_t curr_transcation = PROVISIONEE_TRANSACTION_START_VALUE;
    /* Can't send data until a link is established*/
    TEST_ASSERT_EQUAL(NRF_ERROR_INVALID_STATE, prov_bearer_adv_tx(&bearer, data, PROV_PAYLOAD_MAX_LENGTH));

    /* Start listenining. */
    listen_start(&bearer.bearer.pb_adv);
    /* LINK_OPEN */
    nrf_mesh_configure_device_uuid_get_ExpectAndReturn(uuid1);
    rx_link_open(&bearer.bearer.pb_adv, uuid1, link_id, true);

    TEST_ASSERT_EQUAL(curr_transcation, bearer.bearer.pb_adv.transaction_out);
    uint8_t no_segments = send_data_packet(&bearer.bearer.pb_adv, data, 1);
    TEST_ASSERT_EQUAL(1, no_segments);

    /* Send in ack with wrong transcation value, it should be ignored */
    ble_ad_data_t * p_ack_packet = get_transaction_ack_packet(curr_transcation-1);
    prov_bearer_adv_packet_in(p_ack_packet->data, p_ack_packet->length - BLE_AD_DATA_OVERHEAD, &m_dummy_metadata);
    /* LINK_OPEN and LINK_ACK control messages should also be ignored */
    nrf_mesh_configure_device_uuid_get_ExpectAndReturn(uuid1);
    rx_link_open(&bearer.bearer.pb_adv, uuid1, link_id, false);
    rx_link_ack(&bearer.bearer.pb_adv, link_id, false);
    /* Send in an ack */
    receive_data_ack(&bearer.bearer.pb_adv, link_id, true);
    curr_transcation++;
    /* Ignore if not expecting an ack */
    receive_data_ack(&bearer.bearer.pb_adv, link_id, false);

    /* Send the largest possible data packet */
    no_segments = send_data_packet(&bearer.bearer.pb_adv, data, PROV_PAYLOAD_MAX_LENGTH);
    /* transcation no must be incremented for each new transaction */
    TEST_ASSERT_EQUAL(curr_transcation, bearer.bearer.pb_adv.transaction_out);
    TEST_ASSERT_EQUAL(3, no_segments);
    /* No ACK */
    /* Time out cb when the link time out has passed: this should produce a LINK_CLOSE message*/
    /* First attempt to TX fails*/
    timestamp_t timeout_timestamp = bearer.bearer.pb_adv.sar_timeout + 1;
    ALLOC_AND_TX(&bearer.bearer.pb_adv.advertiser, PROV_ADV_OVERHEAD + PROV_LINK_CLOSE_DATA_SIZE, false);
    bearer.bearer.pb_adv.timeout_event.cb(bearer.bearer.pb_adv.sar_timeout + 1, &bearer.bearer.pb_adv);

    /* timeout interval should be larger than 0 */
    TEST_ASSERT(bearer.bearer.pb_adv.timeout_event.interval > 0);
    /* Timeout value should be updated to NOW to ensure a timeout trigger for the next retry cb. */
    TEST_ASSERT_EQUAL(timeout_timestamp, bearer.bearer.pb_adv.sar_timeout);
    ALLOC_AND_TX(&bearer.bearer.pb_adv.advertiser, PROV_ADV_OVERHEAD + PROV_LINK_CLOSE_DATA_SIZE, true);
    bearer.bearer.pb_adv.timeout_event.cb(bearer.bearer.pb_adv.sar_timeout+1, &bearer.bearer.pb_adv);
    TEST_ASSERT_EQUAL(PROV_BEARER_ADV_UNACKED_REPEAT_COUNT, m_packet.config.repeats);

    /* Send queue empty in order to move on to link closed state */
    timer_sch_abort_Expect(&bearer.bearer.pb_adv.timeout_event);
    advertiser_flush_Expect(&bearer.bearer.pb_adv.advertiser);
    prov_cb_link_closed_Expect(prov_bearer_adv_parent_get(&bearer.bearer.pb_adv), NRF_MESH_PROV_LINK_CLOSE_REASON_TIMEOUT);
    timer_sch_abort_Expect(&bearer.bearer.pb_adv.link_timeout_event);
    bearer.bearer.pb_adv.queue_empty_pending = true;
    TEST_ASSERT_NOT_NULL(m_async_cb);
    m_async_cb();
    /* Receive a link close when in TX state */
    /* Start listenining. */
    listen_start(&bearer.bearer.pb_adv);
    /* LINK_OPEN */
    nrf_mesh_configure_device_uuid_get_ExpectAndReturn(uuid1);
    rx_link_open(&bearer.bearer.pb_adv, uuid1, link_id, true);
    no_segments = send_data_packet(&bearer.bearer.pb_adv, data, 1);
    TEST_ASSERT_EQUAL(1, no_segments);
    /* Close link*/
    timer_sch_abort_Expect(&bearer.bearer.pb_adv.timeout_event);
    rx_link_close(&bearer.bearer.pb_adv, NRF_MESH_PROV_LINK_CLOSE_REASON_SUCCESS, link_id, true);
}

void test_packet_receive(void)
{
    prov_bearer_t bearer = {0};
    uint32_t link_id = 0xDAFA;
    uint8_t curr_transcation = PROVISIONEE_TRANSACTION_START_VALUE;
    /** Establish a connection **/
    /* Open link. */
    tx_link_open(&bearer.bearer.pb_adv, uuid1, link_id);
    /* Link ACK */
    rx_link_ack(&bearer.bearer.pb_adv, link_id, true);
    TEST_ASSERT_EQUAL(curr_transcation, bearer.bearer.pb_adv.transaction_in);

    /* Send the largest packet that can fit into a single segment. */
    receive_data(&bearer.bearer.pb_adv, data, PROV_START_PDU_PAYLOAD_MAX_LEN, curr_transcation++, link_id);
    TEST_ASSERT_EQUAL(curr_transcation, bearer.bearer.pb_adv.transaction_in);

