paladinzh/BLE_Mesh/NRF_MESH/nRF5_SDK_for_Mesh/mesh/test/src/ut_prov_bearer_adv.c
    /* Send a large enough packet to split it in two with only 1 byte in the continue packet. */
    receive_data(&bearer.bearer.pb_adv, data, PROV_START_PDU_PAYLOAD_MAX_LEN + 1, curr_transcation++, link_id);
    TEST_ASSERT_EQUAL(curr_transcation, bearer.bearer.pb_adv.transaction_in);

    /* Send a large packet that barely fits two packets*/
    receive_data(&bearer.bearer.pb_adv, data, PROV_START_PDU_PAYLOAD_MAX_LEN + PROV_CONTINUE_PDU_PAYLOAD_MAX_LEN, curr_transcation++, link_id);
    TEST_ASSERT_EQUAL(curr_transcation, bearer.bearer.pb_adv.transaction_in);

    /* Send a large enough packet to split it in three with only 1 byte in the last continue packet. */
    receive_data(&bearer.bearer.pb_adv, data, PROV_START_PDU_PAYLOAD_MAX_LEN + PROV_CONTINUE_PDU_PAYLOAD_MAX_LEN + 1, curr_transcation++, link_id);
    TEST_ASSERT_EQUAL(curr_transcation, bearer.bearer.pb_adv.transaction_in);

    /* Send the largest possible data packet */
    receive_data(&bearer.bearer.pb_adv, data, PROV_PAYLOAD_MAX_LENGTH, curr_transcation++, link_id);
    TEST_ASSERT_EQUAL(curr_transcation, bearer.bearer.pb_adv.transaction_in);

    /* Bump up the transaction number to a near wrap_around*/
    bearer.bearer.pb_adv.transaction_in = 0xFF;
    curr_transcation = 0xFF;
    receive_data(&bearer.bearer.pb_adv, data, PROV_START_PDU_PAYLOAD_MAX_LEN, curr_transcation++, link_id);
    TEST_ASSERT_EQUAL(curr_transcation, bearer.bearer.pb_adv.transaction_in);
    /* Re send the old packet after the wrap around and expect a response but no callback!*/
    ALLOC_AND_TX(&bearer.bearer.pb_adv.advertiser, PROV_ADV_OVERHEAD + PROV_TRANS_ACK_DATA_SIZE, true);
    prov_cb_pkt_in_Expect(prov_bearer_adv_parent_get(&bearer.bearer.pb_adv), NULL, 1);
    prov_cb_pkt_in_IgnoreArg_p_data();
    timer_now_ExpectAndReturn(1000);
    timer_sch_reschedule_Expect(&bearer.bearer.pb_adv.link_timeout_event, 1000 + bearer.bearer.pb_adv.link_timeout);
    ble_ad_data_t * p_ad_data = get_transaction_start_packet(data, 1, curr_transcation);
    prov_bearer_adv_packet_in(p_ad_data->data, p_ad_data->length - BLE_AD_DATA_OVERHEAD, &m_dummy_metadata);
    TEST_ASSERT_EQUAL(1, m_packet.config.repeats);
    TEST_ASSERT_EQUAL(curr_transcation+1, bearer.bearer.pb_adv.transaction_in);

    rx_link_close(&bearer.bearer.pb_adv, NRF_MESH_PROV_LINK_CLOSE_REASON_SUCCESS, link_id, true);

    /* Send unknown control packet. Nothing should happen*/
    p_ad_data = get_link_open_packet(uuid1);
    p_ad_data->data[PROV_ADV_OVERHEAD - sizeof(ble_ad_data_t)] = 0xFF;
    prov_bearer_adv_packet_in(p_ad_data->data, p_ad_data->length - BLE_AD_DATA_OVERHEAD, &m_dummy_metadata);

    /* Start listenining. */
    listen_start(&bearer.bearer.pb_adv);
    /* Send unknown control packet. Nothing should happen*/
    p_ad_data = get_link_open_packet(uuid1);
    p_ad_data->data[PROV_ADV_OVERHEAD - sizeof(ble_ad_data_t)] = 0xFF;
    prov_bearer_adv_packet_in(p_ad_data->data, p_ad_data->length - BLE_AD_DATA_OVERHEAD, &m_dummy_metadata);

    listen_stop(&bearer.bearer.pb_adv);
}

void test_packet_receive_abnormal(void)
{
    prov_bearer_t bearer = {0};
    uint32_t link_id = 0xBACA;
    uint8_t curr_transcation = PROVISIONER_TRANSACTION_START_VALUE;
    /* Can't receive data until a link is established*/
    ble_ad_data_t * p_ad_data = get_transaction_start_packet(data,1,0);
    prov_bearer_adv_packet_in(p_ad_data->data, p_ad_data->length - BLE_AD_DATA_OVERHEAD, &m_dummy_metadata);

    /* Start listenining. */
    listen_start(&bearer.bearer.pb_adv);

    /* Can't receive data until a link is established*/
    p_ad_data = get_transaction_start_packet(data,1,0);
    prov_bearer_adv_packet_in(p_ad_data->data, p_ad_data->length - BLE_AD_DATA_OVERHEAD, &m_dummy_metadata);

    /* LINK_OPEN */
    nrf_mesh_configure_device_uuid_get_ExpectAndReturn(uuid1);
    rx_link_open(&bearer.bearer.pb_adv, uuid1, link_id, true);

    TEST_ASSERT_EQUAL(curr_transcation, bearer.bearer.pb_adv.transaction_in);
    /* Send 1 byte long data. */
    receive_data(&bearer.bearer.pb_adv, data, 1, curr_transcation++, link_id);
    TEST_ASSERT_EQUAL(curr_transcation, bearer.bearer.pb_adv.transaction_in);

    /* Send the same data. */
    ALLOC_AND_TX(&bearer.bearer.pb_adv.advertiser, PROV_ADV_OVERHEAD + PROV_TRANS_ACK_DATA_SIZE, true);
    p_ad_data = get_transaction_start_packet(data, 1, curr_transcation-1);
    prov_bearer_adv_packet_in(p_ad_data->data, p_ad_data->length - BLE_AD_DATA_OVERHEAD, &m_dummy_metadata);
    TEST_ASSERT_EQUAL(curr_transcation, bearer.bearer.pb_adv.transaction_in);
    TEST_ASSERT_EQUAL(1, m_packet.config.repeats);

    /* Re-send different data with the same transcation value, it won't care and still send an ack and ignore contents. */
    ALLOC_AND_TX(&bearer.bearer.pb_adv.advertiser, PROV_ADV_OVERHEAD + PROV_TRANS_ACK_DATA_SIZE, true);
    p_ad_data = get_transaction_start_packet(&data[10], 10, curr_transcation-1);
    prov_bearer_adv_packet_in(p_ad_data->data, p_ad_data->length - BLE_AD_DATA_OVERHEAD, &m_dummy_metadata);
    TEST_ASSERT_EQUAL(curr_transcation, bearer.bearer.pb_adv.transaction_in);
    TEST_ASSERT_EQUAL(1, m_packet.config.repeats);


    /* Increment transaction number with a large number, should be OK, and the next expected
     * transaction number should be incremented. */
    curr_transcation += 10;
    receive_data(&bearer.bearer.pb_adv, data, 1, curr_transcation++, link_id);
    TEST_ASSERT_EQUAL(curr_transcation, bearer.bearer.pb_adv.transaction_in);

    /* Send new data with wrong fcs (CRC)*/
    p_ad_data = get_transaction_start_packet(&data[10], 10, curr_transcation);
    trans_data_payload[PROV_ADV_OVERHEAD + 3]++;
    prov_bearer_adv_packet_in(p_ad_data->data, p_ad_data->length - BLE_AD_DATA_OVERHEAD, &m_dummy_metadata);
    TEST_ASSERT_EQUAL(curr_transcation, bearer.bearer.pb_adv.transaction_in);

    /***** Send a new segmented packet and in between send an old packet *****/
    /* First segment of the new packet: */
    p_ad_data = get_transaction_start_packet(data, PROV_START_PDU_PAYLOAD_MAX_LEN +1, curr_transcation);
    prov_bearer_adv_packet_in(p_ad_data->data, p_ad_data->length - BLE_AD_DATA_OVERHEAD, &m_dummy_metadata);
    /* transaction has not been updated yet*/
    TEST_ASSERT_EQUAL(curr_transcation, bearer.bearer.pb_adv.transaction_in);
    /* Re send an old packet but do not expect a response*/
    p_ad_data = get_transaction_start_packet(data, 1, curr_transcation-1);
    prov_bearer_adv_packet_in(p_ad_data->data, p_ad_data->length - BLE_AD_DATA_OVERHEAD, &m_dummy_metadata);
    TEST_ASSERT_EQUAL(curr_transcation, bearer.bearer.pb_adv.transaction_in);
    /* Send the rest of the new packet and expect an ack */
    ALLOC_AND_TX(&bearer.bearer.pb_adv.advertiser, PROV_ADV_OVERHEAD + PROV_TRANS_ACK_DATA_SIZE, true);
    prov_cb_pkt_in_Expect(prov_bearer_adv_parent_get(&bearer.bearer.pb_adv), NULL, PROV_START_PDU_PAYLOAD_MAX_LEN + 1);
    prov_cb_pkt_in_IgnoreArg_p_data();
    timer_now_ExpectAndReturn(1000);
    timer_sch_reschedule_Expect(&bearer.bearer.pb_adv.link_timeout_event, 1000 + bearer.bearer.pb_adv.link_timeout);
    p_ad_data = get_transaction_continue_packet(data, PROV_START_PDU_PAYLOAD_MAX_LEN + 1, curr_transcation++, 1);
    prov_bearer_adv_packet_in(p_ad_data->data, p_ad_data->length - BLE_AD_DATA_OVERHEAD, &m_dummy_metadata);
    TEST_ASSERT_EQUAL(1, m_packet.config.repeats);

    /* transaction number is now updated */
    TEST_ASSERT_EQUAL(curr_transcation, bearer.bearer.pb_adv.transaction_in);

