paladinzh/BLE_Mesh/NRF_MESH/nRF5_SDK_for_Mesh/mesh/test/src/ut_prov_bearer_adv.c
    /* Close the link to remove the internal reference to the bearer. */
    rx_link_close(&bearer.bearer.pb_adv, NRF_MESH_PROV_LINK_CLOSE_REASON_SUCCESS, link_id, true);
}

void test_interface_return(void)
{
    const prov_bearer_interface_t * p_interface = prov_bearer_adv_interface_get();
    TEST_ASSERT_NOT_NULL(p_interface);
    TEST_ASSERT_NOT_NULL(p_interface->tx);
    TEST_ASSERT_NOT_NULL(p_interface->listen_start);
    TEST_ASSERT_NOT_NULL(p_interface->listen_stop);
    TEST_ASSERT_NOT_NULL(p_interface->link_open);
    TEST_ASSERT_NOT_NULL(p_interface->link_close);
    TEST_ASSERT_NOT_NULL(m_async_cb);
}

void test_packet_fcs_sample_check(void)
{
    const uint8_t sample_data_8_7_3[] = {0x00, 0x00};
    TEST_ASSERT_EQUAL(0x14, calculate_3GPP_CRC(sample_data_8_7_3, sizeof(sample_data_8_7_3)));

    const uint8_t sample_data_8_7_4[] = {0x01, 0x01, 0x00, 0x01, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00};
    TEST_ASSERT_EQUAL(0xD6, calculate_3GPP_CRC(sample_data_8_7_4, sizeof(sample_data_8_7_4)));

    const uint8_t sample_data_8_7_5[] = {0x02, 0x00, 0x00, 0x00, 0x00, 0x00};
    TEST_ASSERT_EQUAL(0x64, calculate_3GPP_CRC(sample_data_8_7_5, sizeof(sample_data_8_7_5)));

    const uint8_t sample_data_8_7_6[] =
    {
        0x03, 0x2c, 0x31, 0xa4, 0x7b, 0x57, 0x79, 0x80, 0x9e, 0xf4, 0x4c, 0xb5, 0xea, 0xaf, 0x5c, 0x3e,
        0x43, 0xd5, 0xf8, 0xfa, 0xad, 0x4a, 0x87, 0x94, 0xcb, 0x98, 0x7e, 0x9b, 0x03, 0x74, 0x5c, 0x78,
        0xdd, 0x91, 0x95, 0x12, 0x18, 0x38, 0x98, 0xdf, 0xbe, 0xcd, 0x52, 0xe2, 0x40, 0x8e, 0x43, 0x87,
        0x1f, 0xd0, 0x21, 0x10, 0x91, 0x17, 0xbd, 0x3e, 0xd4, 0xea, 0xf8, 0x43, 0x77, 0x43, 0x71, 0x5d,
        0x4f
    };
    TEST_ASSERT_EQUAL(0xD1, calculate_3GPP_CRC(sample_data_8_7_6, sizeof(sample_data_8_7_6)));

    const uint8_t sample_data_8_7_7[] =
    {
        0x03, 0xf4, 0x65, 0xe4, 0x3f, 0xf2, 0x3d, 0x3f, 0x1b, 0x9d, 0xc7, 0xdf, 0xc0, 0x4d, 0xa8, 0x75,
        0x81, 0x84, 0xdb, 0xc9, 0x66, 0x20, 0x47, 0x96, 0xec, 0xcf, 0x0d, 0x6c, 0xf5, 0xe1, 0x65, 0x00,
        0xcc, 0x02, 0x01, 0xd0, 0x48, 0xbc, 0xbb, 0xd8, 0x99, 0xee, 0xef, 0xc4, 0x24, 0x16, 0x4e, 0x33,
        0xc2, 0x01, 0xc2, 0xb0, 0x10, 0xca, 0x6b, 0x4d, 0x43, 0xa8, 0xa1, 0x55, 0xca, 0xd8, 0xec, 0xb2,
        0x79
    };
    TEST_ASSERT_EQUAL(0x10, calculate_3GPP_CRC(sample_data_8_7_7, sizeof(sample_data_8_7_7)));

    const uint8_t sample_data_8_7_8[] = {0x05, 0xb3, 0x8a, 0x11, 0x4d, 0xfd, 0xca, 0x1f, 0xe1, 0x53, 0xbd, 0x2c, 0x1e, 0x0d, 0xc4, 0x6a, 0xc2};
     TEST_ASSERT_EQUAL(0xD1, calculate_3GPP_CRC(sample_data_8_7_8, sizeof(sample_data_8_7_8)));

    const uint8_t sample_data_8_7_9[] = {0x05, 0xee, 0xba, 0x52, 0x1c, 0x19, 0x6b, 0x52, 0xcc, 0x2e, 0x37, 0xaa, 0x40, 0x32, 0x9f, 0x55, 0x4e};
     TEST_ASSERT_EQUAL(0xEC, calculate_3GPP_CRC(sample_data_8_7_9, sizeof(sample_data_8_7_9)));

    const uint8_t sample_data_8_7_10[] = {0x06, 0x8b, 0x19, 0xac, 0x31, 0xd5, 0x8b, 0x12, 0x4c, 0x94, 0x62, 0x09, 0xb5, 0xdb, 0x10, 0x21, 0xb9};
    TEST_ASSERT_EQUAL(0xD3, calculate_3GPP_CRC(sample_data_8_7_10, sizeof(sample_data_8_7_10)));

    const uint8_t sample_data_8_7_11[] = {0x06, 0x55, 0xa2, 0xa2, 0xbc, 0xa0, 0x4c, 0xd3, 0x2f, 0xf6, 0xf3, 0x46, 0xbd, 0x0a, 0x0c, 0x1a, 0x3a};
    TEST_ASSERT_EQUAL(0x59, calculate_3GPP_CRC(sample_data_8_7_11, sizeof(sample_data_8_7_11)));

    const uint8_t sample_data_8_7_12[] =
    {
        0x07, 0xd0, 0xbd, 0x7f, 0x4a, 0x89, 0xa2, 0xff, 0x62, 0x22, 0xaf, 0x59, 0xa9, 0x0a, 0x60, 0xad,
        0x58, 0xac, 0xfe, 0x31, 0x23, 0x35, 0x6f, 0x5c, 0xec, 0x29, 0x73, 0xe0, 0xec, 0x50, 0x78, 0x3b,
        0x10, 0xc7
    };
    TEST_ASSERT_EQUAL(0x8B, calculate_3GPP_CRC(sample_data_8_7_12, sizeof(sample_data_8_7_12)));

    const uint8_t sample_data_8_7_13[] = {0x08};
    TEST_ASSERT_EQUAL(0x3E, calculate_3GPP_CRC(sample_data_8_7_13, sizeof(sample_data_8_7_13)));
}

void test_tx_complete(void)
{
    prov_bearer_t bearer = {0};
    uint32_t link_id = 0;

    /** Establish a connection **/
    /* Open link. */
    tx_link_open(&bearer.bearer.pb_adv, uuid1, link_id);
    /* Sent one packet: */
    TEST_ASSERT_EQUAL(1, bearer.bearer.pb_adv.last_token);

    TEST_ASSERT_NOT_NULL(m_tx_complete_cb);
    bearer_event_flag_set_Expect(ASYNC_FLAG);
    m_tx_complete_cb(&bearer.bearer.pb_adv.advertiser, m_packet.token, 0);
    TEST_ASSERT_TRUE(bearer.bearer.pb_adv.queue_empty_pending);

    TEST_ASSERT_NOT_NULL(m_async_cb);
    m_async_cb();
    TEST_ASSERT_FALSE(bearer.bearer.pb_adv.queue_empty_pending);

    rx_link_ack(&bearer.bearer.pb_adv, link_id, true);

    /* Send 3 segment data */
    uint32_t old_last_token = bearer.bearer.pb_adv.last_token;
    uint8_t no_segments = send_data_packet(&bearer.bearer.pb_adv, data, PROV_PDU_MAX_LENGTH);
    TEST_ASSERT_EQUAL(3, no_segments);
    TEST_ASSERT_EQUAL(old_last_token + 3, bearer.bearer.pb_adv.last_token);
    for (uint32_t i = 0; i < 2; ++i)
    {
        /* The token increase once per TX, mirror these tokens to mimic tx complete on each packet. */
        m_packet.token = old_last_token + 1 + i;
        m_tx_complete_cb(&bearer.bearer.pb_adv.advertiser, m_packet.token, 0);
        TEST_ASSERT_FALSE(bearer.bearer.pb_adv.queue_empty_pending);
    }
    bearer_event_flag_set_Expect(ASYNC_FLAG);
    m_packet.token = bearer.bearer.pb_adv.last_token;
    m_tx_complete_cb(&bearer.bearer.pb_adv.advertiser, m_packet.token, 0);
    TEST_ASSERT_TRUE(bearer.bearer.pb_adv.queue_empty_pending);

    /* Receive an ack on the data packet so we can proceed the test */
    receive_data_ack(&bearer.bearer.pb_adv, link_id, true);

    /* Close the link to remove the internal reference to the bearer. */
    rx_link_close(&bearer.bearer.pb_adv, NRF_MESH_PROV_LINK_CLOSE_REASON_SUCCESS, link_id, true);

    /* Start listenining. */
    listen_start(&bearer.bearer.pb_adv);
    /* Should not mark the beacon as a pending tx packet (token should stay at initial value). */
    TEST_ASSERT_EQUAL(0, bearer.bearer.pb_adv.last_token);
    bearer.bearer.pb_adv.queue_empty_pending = false;

    prov_bearer_t bearer_copy = bearer;
    /* We'll get a TX complete callback for every transmitted beacon, but should
     * ignore them all. */
    m_tx_complete_cb(&bearer.bearer.pb_adv.advertiser, m_packet.token, 0);
    m_tx_complete_cb(&bearer.bearer.pb_adv.advertiser, m_packet.token, 0);
    m_tx_complete_cb(&bearer.bearer.pb_adv.advertiser, m_packet.token, 0);
    m_tx_complete_cb(&bearer.bearer.pb_adv.advertiser, m_packet.token, 0);

    TEST_ASSERT_EQUAL_MEMORY(&bearer_copy, &bearer, sizeof(bearer));

    /* Getting an unprompted async process call shouldn't do anything */
    m_async_cb();
    TEST_ASSERT_EQUAL_MEMORY(&bearer_copy, &bearer, sizeof(bearer));
}
